# Joshua Chavez
## Week 13  4/9/24
### Python - Pandas DataFrame Processing

In [2]:
import numpy as np

import pandas as pd

from pandas import Series,DataFrame

In [4]:
df = pd.DataFrame(np.arange(16).reshape(4, 4),
                  index=['Ohio', 'Colorado', 'Utah', 'New York'],
                  columns=['one', 'two', 'Three', 'four'])

In [6]:
type (df)

pandas.core.frame.DataFrame

In [7]:
s = df['two']

In [8]:
s

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [9]:
type(s)

pandas.core.series.Series

In [11]:
one_column = df['one']
type(one_column)

pandas.core.series.Series

In [14]:
df[['one','two']]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [15]:
df.iloc[0]

one      0
two      1
Three    2
four     3
Name: Ohio, dtype: int32

In [16]:
df.iloc[0,0]

0

In [18]:
df

          one  two  Three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
df['five']= np.arange(1,5)

In [21]:
df

          one  two  Three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [22]:
#drop
df1= df.copy()
df2 =df.copy()

In [23]:
df.drop(['Colorado'])

          one  two  Three  four  five
Ohio        0    1      2     3     1
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [24]:
df.drop(['Colorado','Utah'])

          one  two  Three  four  five
Ohio        0    1      2     3     1
New York   12   13     14    15     4

In [25]:
df

          one  two  Three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [26]:
df.drop('five',axis=1)

          one  two  Three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
df

          one  two  Three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [32]:
df.drop(['five', 'two'], axis=1)

          one  Three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [33]:
df

          one  two  Three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [35]:
df.drop(['Ohio', 'Utah'], inplace=True)

In [36]:
df

          one  two  Three  four  five
Colorado    4    5      6     7     2
New York   12   13     14    15     4

In [37]:
df2

          one  two  Three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [38]:
#select entries 

df1

          one  two  Three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [39]:
df1[['one','five']]

          one  five
Ohio        0     1
Colorado    4     2
Utah        8     3
New York   12     4

In [41]:
df1[:2]

          one  two  Three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2

In [42]:
df1[df1["Three"]>5]

          one  two  Three  four  five
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [43]:
df1>5

            one    two  Three   four   five
Ohio      False  False  False  False  False
Colorado  False  False   True   True  False
Utah       True   True   True   True  False
New York   True   True   True   True  False

In [44]:
#SELECTING ENTRIES WITH LOC AND ILOC
df1.loc['Colorado']

one      4
two      5
Three    6
four     7
five     2
Name: Colorado, dtype: int32

In [47]:
df1.loc[['Colorado','Ohio'],['two','four']]

          two  four
Colorado    5     7
Ohio        1     3

In [48]:
df1.loc['Ohio'],['two','four']

(one      0
 two      1
 Three    2
 four     3
 five     1
 Name: Ohio, dtype: int32,
 ['two', 'four'])

In [49]:
df1.iloc[1,2]

6

In [50]:
df1.iloc[0]

one      0
two      1
Three    2
four     3
five     1
Name: Ohio, dtype: int32

In [51]:
df1.iloc[:2,:2]

          one  two
Ohio        0    1
Colorado    4    5

In [52]:
df1.iloc[:2,::2]

          one  Three  five
Ohio        0      2     1
Colorado    4      6     2

In [53]:
df1.values

array([[ 0,  1,  2,  3,  1],
       [ 4,  5,  6,  7,  2],
       [ 8,  9, 10, 11,  3],
       [12, 13, 14, 15,  4]])

In [54]:
df1.iloc[[1,3],[0,2]]

          one  Three
Colorado    4      6
New York   12     14

In [56]:
df1 = pd.DataFrame(np.arange(9).reshape(3, 3), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])

In [57]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [58]:
df2 = DataFrame(np.arange(12).reshape(4,3), columns=list('BDE'), index =['Ohio', 'Texas', 'Colorado', 'Oregon'] )

In [59]:
df2

          B   D   E
Ohio      0   1   2
Texas     3   4   5
Colorado  6   7   8
Oregon    9  10  11

In [60]:
df1+df2

           B   D   E   b   c   d
Colorado NaN NaN NaN NaN NaN NaN
Ohio     NaN NaN NaN NaN NaN NaN
Oregon   NaN NaN NaN NaN NaN NaN
Texas    NaN NaN NaN NaN NaN NaN

In [62]:
#fill the NaN + number with 0 
df1.add(df2,fill_value = 0)

            B     D     E    b    c    d
Colorado  6.0   7.0   8.0  6.0  7.0  8.0
Ohio      0.0   1.0   2.0  0.0  1.0  2.0
Oregon    9.0  10.0  11.0  NaN  NaN  NaN
Texas     3.0   4.0   5.0  3.0  4.0  5.0

In [63]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [64]:
df1 ['e']= df1['b']+ df1['d']
df1

          b  c  d   e
Ohio      0  1  2   2
Texas     3  4  5   8
Colorado  6  7  8  14

In [65]:
#Operation between DataFrame and Series
s= df2.iloc[0]
s

B    0
D    1
E    2
Name: Ohio, dtype: int32

In [66]:
df2

          B   D   E
Ohio      0   1   2
Texas     3   4   5
Colorado  6   7   8
Oregon    9  10  11

In [67]:
df2 -s

          B  D  E
Ohio      0  0  0
Texas     3  3  3
Colorado  6  6  6
Oregon    9  9  9

In [68]:
#sort by rank 
#values, the data itself
#index

In [71]:
df3 = pd.DataFrame(np.arange(8).reshape(2, 4), index=['three', 'one'], columns=list("dacb"))

In [72]:
df3

       d  a  c  b
three  0  1  2  3
one    4  5  6  7

In [73]:
df3.sort_index(axis=1)

       a  b  c  d
three  1  3  2  0
one    5  7  6  4

In [74]:
df3.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  2  3  1
one    4  6  7  5

In [77]:
#sort data frame by values
df4 = pd.DataFrame({'a': [4, 7, -3, 0, -2], 'b': [1, 5, -5, 0, 2]})
df4

   a  b
0  4  1
1  7  5
2 -3 -5
3  0  0
4 -2  2

In [78]:
#sort data by columns 'a', 'b'
df4.sort_values(by='b')

   a  b
2 -3 -5
3  0  0
0  4  1
4 -2  2
1  7  5

In [79]:
df4

   a  b
0  4  1
1  7  5
2 -3 -5
3  0  0
4 -2  2

In [80]:
df4.sort_values(by='a')

   a  b
2 -3 -5
4 -2  2
3  0  0
0  4  1
1  7  5